RT-Thread/rt-thread/bsp/stm32/libraries/STM32U5xx_HAL/STM32U5xx_HAL_Driver/Src/stm32u5xx_hal_flash_ex.c
  if ((Banks & FLASH_BANK_1) != 0U)
  {
    SET_BIT(FLASH->SECHDPCR, FLASH_SECHDPCR_HDP1_ACCDIS);
  }

  if ((Banks & FLASH_BANK_2) != 0U)
  {
    SET_BIT(FLASH->SECHDPCR, FLASH_SECHDPCR_HDP2_ACCDIS);
  }
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @}
  */

/** @addtogroup FLASHEx_Exported_Functions_Group2 FLASHEx Exported Functions Group2
  * @{
  */

/**
  * @brief  Configuration of the privilege attribute.
  *
  * @param  PrivMode indicate privilege mode configuration
  *         This parameter can be one of the following values:
  *            @arg FLASH_SPRIV_GRANTED:  access to secure Flash registers is granted to privileged
  *                                       or unprivileged access
  *            @arg FLASH_SPRIV_DENIED:   access to secure Flash registers is denied
  *                                       to unprivileged access
  *            @arg FLASH_NSPRIV_GRANTED: access to non-secure Flash registers is granted to privileged
  *                                       or unprivileged access
  *            @arg FLASH_NSPRIV_DENIED:  access to non-secure Flash registers is denied
  *                                       to unprivilege access
  *
  * @retval None
  */
void HAL_FLASHEx_ConfigPrivMode(uint32_t PrivMode)
{
  /* Check the parameters */
  assert_param(IS_FLASH_CFGPRIVMODE(PrivMode));

  MODIFY_REG(FLASH->PRIVCFGR, (FLASH_PRIVCFGR_SPRIV | FLASH_PRIVCFGR_NSPRIV), PrivMode);
}

/**
  * @brief  Return the value of the privilege attribute.
  *
  * @retval  It indicates the privilege mode configuration.
  *          This return value can be one of the following values:
  *            @arg FLASH_SPRIV_GRANTED:  access to secure Flash registers is granted to privileged
  *                                       or unprivileged access
  *            @arg FLASH_SPRIV_DENIED:   access to secure Flash registers is denied
  *                                       to unprivileged access
  *            @arg FLASH_NSPRIV_GRANTED: access to non-secure Flash registers is granted to privileged
  *                                       or unprivileged access
  *            @arg FLASH_NSPRIV_DENIED:  access to Flash registers is denied
  *                                       to unprivilege accessP
  */
uint32_t HAL_FLASHEx_GetPrivMode(void)
{
  return (FLASH->PRIVCFGR & (FLASH_PRIVCFGR_SPRIV | FLASH_PRIVCFGR_NSPRIV));
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Configuration of the security inversion.
  *
  * @param  SecInvState indicate the flash security state configuration
  *          This parameter can be one of the following values:
  *            @arg FLASH_SEC_INV_DISABLE: Security state of Flash is not inverted
  *            @arg FLASH_SEC_INV_ENABLE: Security state of Flash is inverted
  *
  * @retval HAL Status
  */
HAL_StatusTypeDef HAL_FLASHEx_ConfigSecInversion(uint32_t SecInvState)
{
  HAL_StatusTypeDef status;

  /* Check the parameters */
  assert_param(IS_FLASH_CFGSECINV(SecInvState));

  /* Process Locked */
  __HAL_LOCK(&pFlash);

  /* Wait for last operation to be completed */
  status = FLASH_WaitForLastOperation(FLASH_TIMEOUT_VALUE);

  if (status == HAL_OK)
  {
    MODIFY_REG(FLASH->SECCR, FLASH_SECCR_INV, SecInvState);
  }

  /* Process Unlocked */
  __HAL_UNLOCK(&pFlash);

  return status;
}

/**
  * @brief  Return the value of the security inversion.
  *
  * @retval  It indicates the flash security state configuration
  *          This return value can be one of the following values:
  *            @arg FLASH_SEC_INV_DISABLE: Security state of Flash is not inverted
  *            @arg FLASH_SEC_INV_ENABLE: Security state of Flash is inverted
  */
uint32_t HAL_FLASHEx_GetSecInversion(void)
{
  return (FLASH->SECCR & FLASH_SECCR_INV);
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Enable the Power-down Mode for Flash Banks
  * @param  Banks indicate which bank to put in power-down mode
  *          This parameter can be one of the following values:
  *            @arg FLASH_BANK_1: Flash Bank 1
  *            @arg FLASH_BANK_2: Flash Bank 2
  *            @arg FLASH_BANK_BOTH: Flash Bank 1 and Bank 2
  * @retval HAL Status
  */
HAL_StatusTypeDef HAL_FLASHEx_EnablePowerDown(uint32_t Banks)
{
  HAL_StatusTypeDef status = HAL_OK;
  uint32_t tickstart;

  /* Check the parameters */
  assert_param(IS_FLASH_BANK(Banks));

  /* Request power-down mode for Bank 1 */
  if ((Banks & FLASH_BANK_1) != 0U)
  {
    /* Check PD1 and PDREQ1 bits (Bank 1 is not in power-down mode and not being
       already under power-down request) */
    if ((FLASH->NSSR & FLASH_NSSR_PD1) != 0U)
    {
      status = HAL_ERROR;
    }
    else if ((FLASH->ACR & FLASH_ACR_PDREQ1) != 0U)
    {
      status = HAL_ERROR;
    }
    else
    {
      /* Unlock PDREQ1 bit */
      WRITE_REG(FLASH->PDKEY1R, FLASH_PDKEY1_1);
      WRITE_REG(FLASH->PDKEY1R, FLASH_PDKEY1_2);

      /* Set PDREQ1 in FLASH_ACR register */
      SET_BIT(FLASH->ACR, FLASH_ACR_PDREQ1);

      /* Check PD1 bit */
      tickstart = HAL_GetTick();
      while (((FLASH->NSSR & FLASH_NSSR_PD1) != FLASH_NSSR_PD1))
      {
        if ((HAL_GetTick() - tickstart) > FLASH_TIMEOUT_VALUE)
        {
          return HAL_TIMEOUT;
        }
      }
    }
  }

  /* Request power-down mode for Bank 2 */
  if ((Banks & FLASH_BANK_2) != 0U)
  {
    /* Check PD2 and PDREQ2 bits (Bank 2 is not in power-down mode and not being
       already under power-down request) */
    if ((FLASH->NSSR & FLASH_NSSR_PD2) != 0U)
    {
      status = HAL_ERROR;
    }
    else if ((FLASH->ACR & FLASH_ACR_PDREQ2) != 0U)
    {
      status = HAL_ERROR;
    }
    else
    {
      /* Unlock PDREQ2 bit */
      WRITE_REG(FLASH->PDKEY2R, FLASH_PDKEY2_1);
      WRITE_REG(FLASH->PDKEY2R, FLASH_PDKEY2_2);

      /* Set PDREQ2 in FLASH_ACR register */
      SET_BIT(FLASH->ACR, FLASH_ACR_PDREQ2);

      /* Check PD2 bit */
      tickstart = HAL_GetTick();
      while (((FLASH->NSSR & FLASH_NSSR_PD2) != FLASH_NSSR_PD2))
      {
        if ((HAL_GetTick() - tickstart) > FLASH_TIMEOUT_VALUE)
        {
          return HAL_TIMEOUT;
        }
      }
    }
  }

